(() => {
    window.g_Table = window.g_Table || {};
    window.g_Table.tbAttack = {
        1001: {//普攻第一下
            tag: 11001,
            x: 20,
            y: 9,
            w: 13,
            h: 10,
        },
        1002: {//普攻第二下
            tag: 11002,
            x: 19,
            y: 8,
            w: 21,
            h: 12,
        },
        1003: {//普攻第三下
            tag: 11003,
            x: 19,
            y: 3,
            w: 21,
            h: 38,
        },
        1004: {//普攻第四下
            tag: 11004,
            x: 19,
            y: 11,
            w: 21,
            h: 30,
        },
        1005: {//跳踢
            tag: 11005,
            x: 16,
            y: -12,
            w: 23,
            h: 32,
        },
    }
})()