(() => {
    window.g_Table = window.g_Table || {};
    window.g_Table.tbPlot = {
        1000: {
            x: 0,
            y: 0,
            w: 0,
            h: 0,
            label: "进入游戏教学--按enter继续"
        },
        1001: {//玩家1
            x: -193,
            y: -212,
            w: 100,
            h: 100,
            label: "这里是角色1，通过键盘左侧操作(A D S J K L U I O ),具体操作请观看“帮助”--按enter继续",
            arrow: {
                x: -35,
                y: -200,
                r: 92
            }
        },
        1002: {//玩家2
            x: 146,
            y: -212,
            w: 100,
            h: 100,
            label: "这里是角色2，通过键盘右侧操作,具体操作请观看“帮助”--按enter继续",
            arrow: {
                x: -20,
                y: -200,
                r: 272
            }
        },
        1003: {//玩家1头像
            x: -430,
            y: 270,
            w: 150,
            h: 150,
            label: "这里是玩家1所选角色的头像--按enter继续",
            arrow: {
                x: -420,
                y: 140,
                r: 0
            }
        },
        1004: {//玩家2头像
            x: 430,
            y: 270,
            w: 150,
            h: 150,
            label: "这里是玩家2所选角色的头像--按enter继续",
            arrow: {
                x: 420,
                y: 140,
                r: 0
            }
        },
        1005: {//时间
            x: 0,
            y: 280,
            w: 100,
            h: 100,
            label: "这里是时间，练习模式是无限的，双人游戏可以选择时间(无限或者60秒)，时间结束血量多的一方胜利--按enter继续",
            arrow: {
                x: 0,
                y: 140,
                r: 0
            }
        },
        1006: {//玩家1血量
            x: -340,
            y: 280,
            w: 100,
            h: 100,
            label: "这里是玩家1的血量，血量清空时游戏结束--按enter继续",
            arrow: {
                x: -350,
                y: 140,
                r: 0
            }
        },
        1007: {//玩家2血量
            x: 340,
            y: 280,
            w: 100,
            h: 100,
            label: "这里是玩家2的血量，血量清空时游戏结束--按enter继续",
            arrow: {
                x: 350,
                y: 140,
                r: 0
            }
        },
        1008: {//玩家1怒气
            x: -140,
            y: -280,
            w: 100,
            h: 100,
            label: "这里是玩家1的怒气，释放大招(O)会消耗一格怒气,受到攻击或者释放技能会加怒气--按enter继续",
            arrow: {
                x: -20,
                y: -200,
                r: 120
            }
        },
        1009: {//玩家2怒气
            x: 140,
            y: -280,
            w: 100,
            h: 100,
            label: "这里是玩家2的怒气，释放大招(5)会消耗一格怒气,受到攻击或者释放技能会加怒气--按enter继续",
            arrow: {
                x: -8,
                y: -235,
                r: 250
            }
        },
    }
})()